app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 9 LIMIT 1
---
  def authenticate_user!
    auth_header = request.headers['Authorization']
    token = auth_header&.split&.last
    return head(:unauthorized) unless token

    begin
      decoded = JsonWebToken.decode(token)
      return head(:unauthorized) unless decoded && decoded[:user_id]
      @current_user = User.find_by(id: decoded[:user_id])

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = 8 LIMIT 1
SELECT "organizations".* FROM "organizations" WHERE "organizations"."organization_id" = '7' LIMIT 1
---
  def set_tenant
    return unless @current_user
    current_tenant = Organization.find_by(id: @current_user.organization_id)
    set_current_tenant(current_tenant) if current_tenant.present?