app/controllers/authenticate_controller.rb

  def login
    user = User.find_for_database_authentication(email: auth_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'admin@gmail.com' ORDER BY "users"."id" ASC LIMIT 1