app/controllers/bookings_controller.rb

  def index
    @bookings = policy_scope(Booking.includes(:user, :sports_field))
    authorize Booking

    render json: @bookings.map { |booking|
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."sports_field_id" = '7' AND "bookings"."user_id" = '10'
SELECT "sports_fields".* FROM "sports_fields" WHERE "sports_fields"."id" IN (1, 3)
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 6)
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = '6'