app/controllers/sports_fields_controller.rb

SELECT "sports_fields".* FROM "sports_fields"
---
  def index
    @sports_fields = SportsField.all