app/controllers/sports_fields_controller.rb

  def index
    @sports_fields = SportsField.where(is_active: true)
---
SELECT "sports_fields".* FROM "sports_fields" WHERE "sports_fields"."is_active" = 1

  def create
    @sports_field = SportsField.new(sports_field_params)

    if @sports_field.save
---
INSERT INTO "sports_fields" ("name", "owner_id", "field_type", "address", "latitude", "longitude", "hourly_rate", "description", "image_url", "is_active", "created_at", "updated_at") VALUES ('Dhuku Futsal', '5', 'Futsal', 'maharajgung', NULL, NULL, 2000.0, 'Dhuku Futsal', '', 1, '2025-08-12 05:40:12.084298', '2025-08-12 05:40:12.084298') RETURNING "id"

  def destroy
    @sports_field.destroy!
---
DELETE FROM "sports_fields" WHERE "sports_fields"."id" = 1

    def set_sports_field
      @sports_field = SportsField.find(params.expect(:id))
---
SELECT "sports_fields".* FROM "sports_fields" WHERE "sports_fields"."id" = 2 LIMIT 1